trade_exp/src/InformationRegisters/Патерностеры/Патерностеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3347a283-ea6c-4862-9497-8f2154904bdb">
  <name>Патерностеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="28af626b-96d5-4031-ad57-dc748544f750">
    <name>Патерностер</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="35574121-fd65-43c5-9c07-79d36fc4fc55">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="3c7bf49b-4de8-4064-b841-59c59fda6fb4">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="61b23e85-c677-44d9-a19b-6969f6adc4da">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/Патерностеры/Forms/Док_ФормаЗаписи/Module.bsl
&НаСервере
Функция ПроверитьЗанятостьПатерностера()    
	Возврат РегистрыСведений.Патерностеры.ПроверитьЗанятостьПатерностера(Запись.Склад, Запись.Номенклатура, Запись.Характеристика, Запись.Патерностер, ТекущаяДата());	
КонецФункции
 
&НаКлиенте
Процедура ПослеЗакрытияВопросаЗанятыйПатерностер(Результат, Параметры) Экспорт
 
	Если Результат = КодВозвратаДиалога.ОК Тогда 
		ЗаписатьПатерностерВРегистр();
		ЭтаФорма.Модифицированность = Ложь;
		Закрыть();
	ИначеЕсли Результат = КодВозвратаДиалога.Отмена Тогда   
		Запись.Патерностер = Неопределено;
	КонецЕсли;	
 
КонецПроцедуры   

&НаКлиенте
Процедура ПатерностерПриИзменении(Элемент) 
	Если ЗначениеЗаполнено(Запись.Патерностер)  Тогда 
		ЗанятостьПатерностера = ПроверитьЗанятостьПатерностера(); 
		Если  ЗанятостьПатерностера.Занятость = 1  Тогда
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаЗанятыйПатерностер",ЭтотОбъект,ЗанятостьПатерностера.Характеристика);
			ПоказатьВопрос(Оповещение,СтрШаблон("На данном валу уже хранится - %1. Заменить на данном валу - 'Ок', для выбора свободного вала, нажмите - 'Отмена'. Свободные валы - %2",ЗанятостьПатерностера.Номенклатура,ЗанятостьПатерностера.СвободныеВалы),РежимДиалогаВопрос.ОКОтмена,0,КодВозвратаДиалога.ОК);
		КонецЕсли;   
	КонецЕсли;
КонецПроцедуры   

&НаСервере
Процедура ЗаписатьПатерностерВРегистр()
	РегистрыСведений.Патерностеры.ЗаписатьПатерностер(Запись.Склад,Запись.Номенклатура,Запись.Характеристика,Запись.Патерностер, ТекущаяДата());
КонецПроцедуры
